<img src="https://marketing4ecommerce.net/wp-content/uploads/2015/09/logo-iebs.jpg" style="float:right" width="400">

# Introducción a los lenguajes de programación

## Estructuras de datos en Python

### Javier Cózar

A continuación trabajaremos con un dataset real y realizaremos algunas operaciones de transformación típicas con pandas.

El dataset lo obtendremos de una de las plataformas más relevantes en data science, __Kaggle__. Esta web organiza competiciones de data science y libera una serie de tutoriales, datasets y libretas muy interesantes para seguir aprendiendo.

Concretamente utilizaremos el dataset _salaries_ que contiene datos ficticios sobre los pagos de la plantilla de una empresa.

Lo tenéis descargado en la carpeta data, pero podéis obtenerlo de 

[SF Salaries Dataset](https://www.kaggle.com/kaggle/sf-salaries)

## Tareas

### Importa pandas

In [1]:
import pandas as pd

### Carga el fichero salaries.csv

In [2]:
salaries = pd.read_csv('Salaries.csv')

/var/folders/jy/88_thsfj3xx4wvtlz4y08p6m7s11b_/T/ipykernel_11074/1908446028.py:1: DtypeWarning: Columns (12) have mixed types. Specify dtype option on import or set low_memory=False.
  salaries = pd.read_csv('Salaries.csv')

### Muestra las primeras filas de este fichero

In [3]:
salaries.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

### Comprueba las variables y su tipo

In [4]:
salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148648 non-null  object
 2   JobTitle          148650 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(7), int64(2), object(4)
memory usage: 14.7+ MB

### Comprueba el nombre de las columnas

In [5]:
salaries.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

### ¿Cual es la media del salario base (BasePay)?

In [6]:
salaries['BasePay'].mean()

66325.4488404877

### ¿Cuál es el mayor número de horas extra pagadas (OvertimePay)?

In [8]:
print(salaries['OvertimePay'].max())
print(salaries['OvertimePay'].nlargest(1))

245131.88
1    245131.88
Name: OvertimePay, dtype: float64

### ¿Cual es el titulo del trabajo (JobTitle) del empleado JOSEPH DRISCOLL?

In [22]:
salaries[salaries["EmployeeName"]=="JOSEPH DRISCOLL"]["JobTitle"]

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [23]:
salaries.set_index("EmployeeName").loc["JOSEPH DRISCOLL"]["JobTitle"]

'CAPTAIN, FIRE SUPPRESSION'

### ¿Cuanto gana este empleado en total (TotalPayBenefits)?

In [25]:
float(salaries[salaries["EmployeeName"]=="JOSEPH DRISCOLL"]["TotalPayBenefits"])

270324.91

### ¿Cómo se llama la persona que más gana?

In [53]:
salaries.sort_values(by="BasePay", ascending=False).head(1)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
72925,72926,Gregory P Suhr,Chief of Police,319275.01,0.0,20007.06,86533.21,339282.07,425815.28,2013,NaN,San Francisco,NaN

In [54]:
salaries.nlargest(1, columns=["BasePay"])

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
72925,72926,Gregory P Suhr,Chief of Police,319275.01,0.0,20007.06,86533.21,339282.07,425815.28,2013,NaN,San Francisco,NaN

### ¿Cual es la paga media por años?

In [55]:
salaries.groupby("Year")["BasePay"].mean()

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

### ¿Cuántos trabajos únicos hay?
Pista, busca en la documentación de pandas la función `drop_duplicates`

In [34]:
salaries.drop_duplicates(subset=["JobTitle"])["JobTitle"].count()

2158

### Combinar dos dataframes en uno solo

Por último vamos a combinar dos dataframes que contienen la misma información pero está dividida por años. Estos datos, que están almacenados en los ficheros `2014-baby-names-raw.csv` y `2015-baby-names-raw.csv`, contienen los nombres de bebes nacidos en los años 2014 y 2015 en Estados Unidos. Cargad ambos ficheros en DataFrames de pandas y combinadlos en un único DataFrame.

In [46]:
ds2014 = pd.read_csv("2014-baby-names-raw.csv").assign(year=2014)

In [47]:
ds2015 = pd.read_csv("2015-baby-names-raw.csv").assign(year=2015)

In [48]:
ds2014.head()

   rank       name  frequency   sex  year
0     1       Noah        837  Male  2014
1     2  Alexander        747  Male  2014
2     3    William        687  Male  2014
3     4    Michael        680  Male  2014
4     5       Liam        670  Male  2014

In [49]:
ds2015.head()

   rank       name  frequency   sex  year
0     1       Noah        863  Male  2015
1     2       Liam        709  Male  2015
2     3  Alexander        703  Male  2015
3     4      Jacob        650  Male  2015
4     5    William        618  Male  2015

In [51]:
pd.concat([ds2014, ds2015])

    rank       name  frequency   sex  year
0      1       Noah        837  Male  2014
1      2  Alexander        747  Male  2014
2      3    William        687  Male  2014
3      4    Michael        680  Male  2014
4      5       Liam        670  Male  2014
..   ...        ...        ...   ...   ...
95    96   Giovanni        168  Male  2015
96    97     Hudson        167  Male  2015
97    98     Camden        165  Male  2015
98    99        Max        164  Male  2015
99   100    Maxwell        155  Male  2015

[201 rows x 5 columns]

In [52]:
pd.concat([pd.read_csv(f"{year}-baby-names-raw.csv").assign(year=year) for year in (2014, 2015)])

    rank       name  frequency   sex  year
0      1       Noah        837  Male  2014
1      2  Alexander        747  Male  2014
2      3    William        687  Male  2014
3      4    Michael        680  Male  2014
4      5       Liam        670  Male  2014
..   ...        ...        ...   ...   ...
95    96   Giovanni        168  Male  2015
96    97     Hudson        167  Male  2015
97    98     Camden        165  Male  2015
98    99        Max        164  Male  2015
99   100    Maxwell        155  Male  2015

[201 rows x 5 columns]